
(function (jok) {

    switch (jok.config.language) {
        case 'ka_GE':
            jok.texts = {
                A001: 'სტატუსი',
                A002: 'ქულები',
                A003: 'ფანები',
                A004: 'მეგობრები',
                A005: 'მეგობრობის შეთავაზება',
                A006: 'მუსიკა',
                A007: 'ქულა',
                A008: 'ვუკავშირდებით Jok-ს',
                A009: 'საჭიროა ავტორიზაცია<br />მიმდინარეობს გადამისამართება...',
                A010: 'ველოდებით მოწინააღმდეგეს...',
                A011: 'გაუზიარეთ და ეთამაშეთ მეგობრებს:',
                A012: 'კავშირი დაიხურა. სცადეთ სხვა მაგიდაზე თამაში',
                A013: 'თამაში სხვა მაგიდაზე',
                A014: 'მოწინააღმდეგე გავიდა',
                A015: 'ითამაშეთ სხვა მაგიდაზე',
                A016: 'მოგებულია:',
                A017: 'კიდევ ვითამაშოთ',
                A018: 'ჩატი',
                A019: 'ემოციები',
                A020: 'მეტი...',
                A021: 'VIP ემოციები',
                A022: '^აკეცვა',
                A023: 'ჩატი',
                A024: 'აკრიფეთ ტექსტი &amp; [Enter]',
                A025: 'გამოსვლა',
                A026: 'ვიმეგობროთ...',
                A027: 'მხოლოდ ემოციები',
            };
            break;

        case 'ru_RU':
            jok.texts = {
                A001: 'Статус',
                A002: 'Очки',
                A003: 'Поклонники',
                A004: 'Друзья',
                A005: 'Отправить запрос о дружбе',
                A006: 'Музыка',
                A007: 'очки',
                A008: 'Подключение к Jok',
                A009: 'Требуется авторизация<br />Перенаправление на вход ...',
                A010: 'В ожидании противника ...',
                A011: 'Отправить и играть со своими друзьями:',
                A012: 'Соединение закрыто. пытаются играть на другом столе',
                A013: 'Играть на другом столе',
                A014: 'Противник ушел',
                A015: 'Играть на другом столе',
                A016: 'Победитель:',
                A017: 'Сыграть еще раз',
                A018: 'Чат',
                A019: 'Эмоции',
                A020: 'подробнее ...',
                A021: 'VIP Эмоции',
                A022: '^ меньше',
                A023: 'Чат',
                A024: 'Введите текст и нажмите [Enter]',
                A025: 'Выход',
                A026: 'Давай дружить ...',
                A027: 'Только эмоции разрешено',
            };
            break;

        default:
            jok.texts = {
                A001: 'Status',
                A002: 'Points',
                A003: 'Fans',
                A004: 'Friends',
                A005: 'Send Friend Request',
                A006: 'Music',
                A007: 'points',
                A008: 'Connecting to jok',
                A009: 'Authorization is required<br />redirecting to login...',
                A010: 'Waiting for opponent...',
                A011: 'Share &amp; play with your friends:',
                A012: 'Connection closed. try to play on another table',
                A013: 'Play on another table',
                A014: 'Opponent went offline',
                A015: 'Play on another table',
                A016: 'Winner:',
                A017: 'Play Again',
                A018: 'Chat',
                A019: 'Smiles',
                A020: 'more...',
                A021: 'VIP Smiles',
                A022: '^less',
                A023: 'Chat',
                A024: 'Just type any text &amp; press [Enter]',
                A025: 'Exit',
                A026: 'Let\'s be friends...',
                A027: 'Only Smiles',
            };
            break;
    }
})(jok);